content-org/pages.org
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: posts
#+HUGO_PRESERVE_ORGCONTENT: t
#+AUTHOR: Elliott Claus

* board games                         :reference:games:
:PROPERTIES:
:EXPORT_FILE_NAME: board-games
:EXPORT_DATE: 2025-01-15
:EXPORT_TITLE: board games i own
:EXPORT_HUGO_CATEGORIES: notes
:END:

** board games

#+BEGIN_export html
<div class="collection-table-wrapper">
  <div class="column-toggle" id="columnToggle"></div>
  <div class="collection-table-container">
    <table class="collection-table" id="collectionTable">
      <thead>
        <tr></tr>
      </thead>
      <tbody></tbody>
    </table>
  </div>
</div>
#+end_export
#+BEGIN_export html
<script>
const config1 = {
  file: "/csv/collection.csv",
  columns: {
    objectname: {
      label: "game",
      visible: true
    },
    yearpublished: {
      label: "published",
      visible: false
    },
    comment: {
      label: "description",
      visible: true
    },
    rating: {
      label: "my rating (1-10)",
      visible: true
    },
    average: {
      label: "average bgg rating (1-10)",
      visible: false
    },
    avgweight: {
      label: "complexity (1-5)",
      visible: false
    },
    playingtime: {
      label: "playtime (min)",
      visible: false
    },
    bggbestplayers: {
      label: "recommended players",
      visible: false
    },
    bggrecagerange: {
      label: "recommended age range",
      visible: false
    },
    rank: {
      label: "bgg rank",
      visible: false
    }
  }
};
</script>
<script src="../../js/csv-table.js"></script>
<script>
document.addEventListener('DOMContentLoaded', () => {
  initializeTable(config1);
});
</script>
#+end_export

(additional note: ratings of 1.0 mean the game is unrated)

data from [[https://boardgamegeek.com/collection/user/defexx][my game collection]] on bgg

additional data from [[https://boardgamegeek.com/][board game geek]]

